Repository: wladwnt/CAN-Gateway-App
Catalog: lib/l10n/app_*.arb
Languages: de

# appTitle
source: MyHome App for Hoval devices
de: MyHome App für Hoval Geräte

source: Settings
de: Einstellungen

# setIPGateway
source: IP address of CAN-Gateway
de: CAN-Gateway IP Adresse

# setPleaseEnterIP
source: Please enter correct IPv4 address!
de: Bitte eine korrekte IPv4 Adresse eingeben!

# setListCGW
source: List of CAN Gateways:
de: Liste von CAN-Gateways:

# setSearchAgain
source: Search again
de: Erneut suchen

# setEnableIntro
source: Enable introduction on App start
de: App Einleitung beim Start zeigen

# enabledLabel
source: Enabled
de: Ein

# disabledLabel
source: Disabled
de: Aus

# deviceCGW
source: CAN Gateway device
de: CAN Gateway:

source: Use this
de: Verwenden

source: Close
de: Schließen

source: Set Value
de: Ändern

# tryAgain
source: Error! Please try again
de: Fehler! Bitte erneut versuchen

# setRequestSuccessful
source: Set request was successful!
de: Änderungsanfrage war erfolgreich!

# enterNewValue
source: Please enter new value.
de: Bitte einen neuen Wert eingeben.

# selectNewValue
source: Please select new value.
de: Bitte einen neuen Wert wählen.

# waitReadingData
source: Please wait, reading data ...
de: Bitte warten, lese Daten aus ...

# searchDoSearch
source: Search for CAN Gateways in your local network ...
de: Suche nach CAN-Gateways in Deinem Netzwerk ...

# searchNoFound
source: No CAN Gateway devices found.
de: Keine CAN-Gateways gefunden.

# searchFound
source: Found!
de: Gefunden!

# cannotConnect
source: Error! Can not connect to CAN Gateway.
de: Fehler! Kann keine Verbindung mit CAN-Gateway herstellen.

# didInstalled
source: Did you install and configure CAN Gateway already?
de: Haben Sie CAN-Gateway bereits installiert und konfiguriert?

source: Try to connect again
de: Erneut versuchen zu verbinden

# didSetIPAddress
source: Did you set the correct IP address of the CAN Gateway in Settings (current IP set is
de: Haben Sie in Einstellungen der App die IP Adresse von CAN-Gateway richtig eingestellt (aktuell eingestellte IP Adresse ist

source: if Yes:
de: Wenn Ja:

# noParametersConfigured
source: No parameters are configure in CAN-Gateway. Therefore this parameter list is empty. Please reconfigure your CAN-Gateway.
de: Keine Parameter in CAN-Gateway sind konfiguriert. Deswegen ist diese Parameterliste leer. Bitte konfiguriere den CAN-Gateway erneut.

# infoForHovalDevices
source: for Hoval devices
de: für Hoval Geräte

# infoMoreInfoGithub
source: Get more Info on GitHub
de: Mehr Info auf GitHub

# infoNeedGateway
source: You will need a special hardware (CAN Gateway) to get the information from / to control you Hoval devices. Please read carefully the information on GitHub. Example:
de: Sie brauchen spezielle Hardware (CAN-Gateway) um Ihre Hoval Geräte mit diesem App zu steuern. Bitte lesen Sie mehr Info auf Github. Beispiel:

# infoHovalCompatible
source: This software as well as the CAN Gateway are not produced/developed/approved by Hoval A.G., but compatible with some products from Hoval.
de: Diese Software sowie CAN-Gateway sind nicht von der Firma Hoval A.G. entwickelt/hergestellt/freigegeben und sind lediglich mit einigen Geräten der Firma Hoval AG kompatibel.

# introSkipIntroCompletely
source: Skip introduction completely
de: Die Einleitung komplett überspringen

# introSkip
source: Skip
de: Überspringen

# introDone
source: Done
de: Fertig

source: Welcome!
de: Willkommen!

# introControlUsingApp
source: Control your Hoval TopTronic EⓇ devices using this App!
de: Kontrolliere Deine Hoval TopTronic EⓇ Geräte mit dieser App!

# introStep1Title
source: Step 1: Install CAN-Gateway
de: Schritt 1: Installiere CAN-Gateway

# introStep1Body
source: See more details on Github:
de: Lese mehr auf Github:

# introStep2Title
source: Step 2: Configure the App
de: Schritt 2: Konfiguriere die App

# introStep2Body
source: Set the IP address of your CAN-Gateway
de: Stelle die IP Adresse von deinem CAN-Gateway ein

# introEnjoy
source: Enjoy the App!
de: Habe Spaß mit der App!

# introEnjoyBody
source: Tap on parameter values to see the history graph or to request value change
de: Um Parameter zu ändern oder den historischen Verlauf anzuschauen, tippe auf die Parameterwerte

# devTypeUnknown
source: Unknown device type
de: Unbekannter Gerätetyp

# menuItemSetValue
source: Set value
de: Wert Ändern

# menuItemShowHist
source: Show history graph
de: Historischer Verlauf anzeigen

# tteTypeWEZ
source: heat generator
de: Wärmeerzeuger

# tteTypeSOL
source: solar unit
de: Solar

# tteTypePS
source: puffer unit
de: Puffer

# tteTypeFW
source: long-distance heating
de: Fernwärme

# tteTypeHKW
source: heating circuit / hot water
de: Heizkreis / Warmwasser

# tteTypeGLT
source: analogue extension
de: Analoge Erweiterung

# tteTypeMWA
source: measurement unit
de: Messmodul

# tteTypeHV
source: HomeVent ventilation
de: HomeVent Lüftung

# tteTypeBM
source: room control unit
de: Bedienmodul

# ssHumidity
source: Humidity
de: Feuchtigkeit

# ssOff
source: Off
de: Aus

# ssOn
source: On
de: Ein

# ssFrostOp
source: Frost
de: Frostbetrieb

# ssFrostProtect
source: Frost
de: Frostschutz

# ssWeek1
source: Week 1
de: Woche 1

# ssWeek2
source: Week 2
de: Woche 2

# ssFault
source: Fault
de: Fehler

# ssConstant
source: Constant
de: Konstant

# ssManualHeating
source: Manual heating
de: Handbetrieb Heizen

# ssManualCooling
source: Manual cooling
de: Handbetrieb Kühlen

# ssEco
source: Eco
de: Spar

# ssHeating
source: Heating
de: Heizen

# ssPreHeating
source: PreHeating
de: Vorlaufzeit Heizbetrieb

# ssExtOff
source: Externally Off
de: Extern gesperrt

# ssCooling
source: Cooling
de: Kühlbetrieb

# ssPreCooling
source: PreCooling
de: Vorlaufzeit Kühlbetrieb

# ssError
source: Error
de: Störung

# ssSummerHumidity
source: Summer humidity
de: Sommerfeuchte

# ssBlocked
source: Blocked
de: Blockiert

# ssWFmaxOff
source: WFmax Off
de: WFmax Abschaltung

# ssWFsollOff
source: WFsoll Off
de: WFsoll Abschaltung

# ssBivalentOff
source: Bivalent Off
de: Bivalenzabschaltung

# ssWarmWaterClosed
source: Warm water closed
de: Warmwasser Ladesperre

# ssMinOff
source: Min Off
de: Minimale Auszeit

# ssMinOn
source: Min On
de: Minimale Einzeit

# ssHeatingUp
source: Heating Up
de: Anheizen

# ssBurnOff
source: Burn Off
de: Ausbrand

# ssPostCarriage
source: Post-carriage
de: Nachlauf

# ssVerzFolgeWE
source: Delayed sequence WE
de: Verzögerung Folge WE

# ssOvertemperature
source: Overtemperature
de: Übertemperatur

# ssComfort
source: Comfort
de: Komfort

# ssForceTaking
source: Force taking
de: Zwangsabnahme

# ssForceSlowdown
source: Force slowdown
de: Zwangsdrosselung

# ssHolidayOperation
source: Holiday operation
de: Ferien

# ssNormalCooling
source: Normal cooling
de: Normal Kühlen

# ssComfortCooling
source: Comfort cooling
de: Komfort Kühlen

# ssEcoCooling
source: Eco cooling
de: Spar Kühlen

# ssManual
source: Manual
de: Handbetrieb

# ssSafeCooling
source: Safe cooling
de: Schutz Kühlbetrieb

# ssPartyCooling
source: Party cooling
de: Party Kühlen

# ssDryDownHeatUp
source: Dry-down heat up
de: Austrocknung Aufheizphase

# ssDryDownNormal
source: Dry-down normal
de: Austrocknung Stationärphase

# ssDryDownCoolDown
source: Dry-down cool down
de: Austrocknung Abkühlphase

# ssDryDownEnd
source: Dry-down end
de: Austrocknung Endphase

# ssCoolingExtConst
source: Cooling external/constant
de: Kühlen Ext./Konst.

# ssHeatingExtConst
source: Heating external/constant
de: Heizen Ext./Konst.

# ssForceCharge
source: Force charge
de: Zwangsladung

# ssWWTaking
source: WW Taking
de: Warmwasser Entnahme

# ssWarning
source: Warning
de: Warnung

# ssReducedChargeMode
source: Reduced charge operation
de: Reduzierter Ladebetrieb

# ssPreferredSmartGridOp
source: Preferred SmartGrid operation
de: Vorzugsbetrieb SmartGrid

# ssForceSmartGridTaking
source: Force SmartGrid taking
de: Abnahmezwang SmartGrid

# raSearchButton
source: Get settings
de: Automatisch

# raSetTitle
source: Remote access settings
de: Fernzugriff Einstellungen

# raAddressSetTitle
source: Remote access address
de: Fernzugriff Adresse

# setPleaseEnterAddress
source: Please enter correct address
de: Bitte korrekte Adresse eingeben

# raPortSetTitle
source: Remote access port
de: Fernzugriff Port

# setPleaseEnterPort
source: Please enter correct port number
de: Bitte korrekten Port Nummer eingeben

# raKeySetTitle
source: Remote access key
de: Fernzugriff Schlüssel

# setPleaseEnterKey
source: Key length must be 32 symbols
de: Llänge muss 32 Symbole betragen

# setEnableRA
source: Use remote access
de: Fernzugriff verwenden

# rAenabledLabel
source: Enabled
de: Ein

# rAdisabledLabel
source: Disabled (use local via LAN/WiFi)
de: Aus (nur lokal über LAN/WLAN)

# youUseRemote
source: You have enabled remote access to CAN-Gateway. Maybe you want to switch it off and use access vial local LAN/WiFi.
de: Sie nutzen Fernzugriff auf CAN-Gateway via Internet. Vielleicht sind Sie im lokalen Netz und möchten den lokalen Zugriff verwenden?

# isRemoteAccessConfigured
source: If not, did you configure remote access properly including address, port and key?
de: Wenn nicht, haben Sie Fernzugriff korrekt konfiguriert (Adresse, Port und Schlüssel)?
